In [ ]:
# Meetup 3 - Pandas tutorial 
Author: Alek Petty - Material based on the XSEDE2016 Pandas workshop from Srijith Rajamohan   
Description: Simple examples of using Python Pandas for data manipulation etc.    
Notes: You may need to install pandas using "conda install pandas".

About Pandas: Pandas is a Python package providing fast, flexible, and expressive data structures designed to make working with "relational" or "labeled" data both easy and intuitive. It aims to be the fundamental high-level building block for doing practical, real world data analysis in Python.   
https://github.com/pydata/pandas

In [2]:
from pandas import DataFrame, read_csv
import pandas as pd

#creating a DataFrame object from multiple DataSeries
# note the auto NaN creation
d={'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']), 
   'two' :pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

df=pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [3]:
#Get labels for each series
names=['Bob', 'Jessica', 'Mary', 'John', 'Mel']
births=[968, 155, 77, 578, 973]

In [4]:
#combine using zip which merges elements from lists into one list
BabyDataSet=zip(names, births)
BabyDataSet

[('Bob', 968), ('Jessica', 155), ('Mary', 77), ('John', 578), ('Mel', 973)]

In [5]:
#create a new dataframe with numbers and strings
df=pd.DataFrame(data=BabyDataSet, columns=['Names', 'Births'])
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [6]:
#save dataframe
df.to_csv('births1880.csv', index=False, header=False)

In [7]:
# Read in that csv file - don't treat first row as a header and provide column names
df=pd.read_csv('births1880.csv', header=None, names=['Names', 'Births'])
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [8]:
#look at top 2 rows
df.head(2)

     Names  Births
0      Bob     968
1  Jessica     155

In [9]:
#look at bottom 2 rows
df.tail(2)

  Names  Births
3  John     578
4   Mel     973

In [10]:
#return the pandas data frame as a numpy array (like a matlab array)
df.values

array([['Bob', 968],
       ['Jessica', 155],
       ['Mary', 77],
       ['John', 578],
       ['Mel', 973]], dtype=object)

In [11]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
#Can simply plot out data using the Pandas matplotlib wrapper
plt=df['Births'].plot()

In [13]:
MaxValue=df['Births'].max()
MaxName=df['Names'][df['Births']==df['Births'].max()].values
MaxName

array(['Mel'], dtype=object)

In [14]:
df['Names'].unique()

array(['Bob', 'Jessica', 'Mary', 'John', 'Mel'], dtype=object)

In [15]:
print(df['Names'].describe())

count        5
unique       5
top       Mary
freq         1
Name: Names, dtype: object

In [16]:
#manipulating data in DataFrames

In [17]:
d=[x for x in xrange(10)] 
d

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [18]:
df=pd.DataFrame(d)
df.columns=['Rev']
df['NewCol']=5

In [19]:
#perform operations on new column
df['NewCol']=df['NewCol']+1

In [20]:
#delete column!
del df['NewCol']
df

   Rev
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9

In [21]:
# Assign index labels
i=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df.index=i
df

   Rev
a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9

In [22]:
#find based on index value
df.loc['a':'d']

   Rev
a    0
b    1
c    2
d    3

In [23]:
df.iloc[0:4]

   Rev
a    0
b    1
c    2
d    3

In [24]:
df['Rev']

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
Name: Rev, dtype: int64

In [25]:
import numpy as np
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
# set a value based on a row/column condition to Nan
df.loc['a', 'two']=np.nan
df

        one       two     three
a  1.453388       NaN  0.177185
c  0.590634 -0.074104 -0.218062
e -0.615647  0.306801 -0.715571
f  1.674850 -0.343629  0.478051
h -1.106923 -0.845168 -1.417561

In [26]:
#set NaN to a number - note that the dataframe still tracks where the NaN was.
df.fillna(-999)

        one         two     three
a  1.453388 -999.000000  0.177185
c  0.590634   -0.074104 -0.218062
e -0.615647    0.306801 -0.715571
f  1.674850   -0.343629  0.478051
h -1.106923   -0.845168 -1.417561

In [27]:
df.query('one > 0')

        one       two     three
a  1.453388       NaN  0.177185
c  0.590634 -0.074104 -0.218062
f  1.674850 -0.343629  0.478051

In [28]:
df.query('one < 0 & two >0')
df

        one       two     three
a  1.453388       NaN  0.177185
c  0.590634 -0.074104 -0.218062
e -0.615647  0.306801 -0.715571
f  1.674850 -0.343629  0.478051
h -1.106923 -0.845168 -1.417561

In [30]:
# lamba acts as a temporary function
# in this case it applies the difference between the max amd min of each column
df.apply(lambda x: x.max())

one      1.674850
two      0.306801
three    0.478051
dtype: float64

In [102]:
df

        one       two     three
a  1.573836       NaN -0.533795
c  0.102310 -1.032851  0.868451
e -0.144610 -1.077127 -2.658451
f  0.310795 -0.315389 -0.058001
h  0.082246 -1.035145 -0.960865

In [103]:
df.applymap(np.sqrt)
# note that the NaNs are restored, so the square root is not calcuated.
#minus values also now produce NaN

        one  two     three
a  1.254526  NaN       NaN
c  0.319860  NaN  0.931907
e       NaN  NaN       NaN
f  0.557490  NaN       NaN
h  0.286786  NaN       NaN

In [104]:
s=pd.Series(np.arange(5), index=np.arange(5)[::-1], dtype='int64')
s.isin([2, 4, 6])

4    False
3    False
2     True
1    False
0     True
dtype: bool

In [105]:
s.where(s>3)

4   NaN
3   NaN
2   NaN
1   NaN
0     4
dtype: float64

In [106]:
#grouping the data
#tells you how to organize the groups of data

In [32]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'], 
                   'B':['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'], 
                   'C':np.random.randn(8), 
                  'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.793363  0.971529
1  bar    one  0.790841 -0.293621
2  foo    two -0.343338  0.550936
3  bar  three -0.004943  0.356408
4  foo    two  0.705161 -0.136566
5  bar    two  0.093209  1.872151
6  foo    one  0.944413 -0.842599
7  foo  three -0.639535  2.103135

In [38]:
#groupings
grouped1=df.groupby('A')
grouped2=df.groupby(['A', 'B'])
grouped3=df.groupby('A', sort=False)
grouped3.size()
grouped4=df.groupby(['C', 'D'])
grouped4.describe()

                  C         D
A
bar count  3.000000  3.000000
    mean   0.293036  0.644979
    std    0.433897  1.111349
    min   -0.004943 -0.293621
    25%    0.044133  0.031393
    50%    0.093209  0.356408
    75%    0.442025  1.114279
    max    0.790841  1.872151
foo count  5.000000  5.000000
    mean  -0.025332  0.529287
    std    0.797225  1.117864
    min   -0.793363 -0.842599
    25%   -0.639535 -0.136566
    50%   -0.343338  0.550936
    75%    0.705161  0.971529
    max    0.944413  2.103135

In [109]:
grouped1.describe()

                  C         D
A
bar count  3.000000  3.000000
    mean  -0.021051 -0.958967
    std    1.439893  0.747620
    min   -1.678907 -1.814748
    25%   -0.490126 -1.222065
    50%    0.698656 -0.629383
    75%    0.807877 -0.531076
    max    0.917097 -0.432770
foo count  5.000000  5.000000
    mean   0.917261 -0.704612
    std    1.043607  1.222469
    min   -0.536879 -2.685050
    25%    0.320648 -0.850406
    50%    1.066565 -0.309541
    75%    1.700731 -0.274796
    max    2.035239  0.596735

In [110]:
list(grouped3)

[('foo',      A      B         C         D
  0  foo    one -0.536879 -2.685050
  2  foo    two  1.700731 -0.309541
  4  foo    two  0.320648  0.596735
  6  foo    one  2.035239 -0.274796
  7  foo  three  1.066565 -0.850406), ('bar',      A      B         C         D
  1  bar    one  0.698656 -1.814748
  3  bar  three  0.917097 -0.432770
  5  bar    two -1.678907 -0.629383)]

In [111]:
grouped3.first()

       B         C         D
A
foo  one -0.536879 -2.685050
bar  one  0.698656 -1.814748

In [113]:
#apply your own functions to each group
grouped3['C'].agg([sum, np.mean])

          sum      mean
A
foo  4.586304  0.917261
bar -0.063154 -0.021051

In [43]:
f=lambda x:x*2
fx['C']
#grouped3.filter(lambda x: sum(x['C'])>0)

TypeError: 'int' object has no attribute '__getitem__'

In [ ]:
#etc...